# HideAllBarsInRebarSet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..HideAllBarsInRebarSet Property
BuiltInFailures..::..RebarFailures Class See Also
---
All Bars in Rebar Set have been hidden.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HideAllBarsInRebarSet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HideAllBarsInRebarSet As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HideAllBarsInRebarSet {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace